```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # module.provision_apps[0].helm_release.argocd will be updated in-place
  ~ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.1.9" -> (known after apply)
          ~ chart          = "argo-cd" -> (known after apply)
          ~ first_deployed = 1748546220 -> (known after apply)
          ~ last_deployed  = 1761358234 -> (known after apply)
          ~ name           = "argocd" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file `server.ingress.enabled` and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the `configs.params."server.insecure"` in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          ~ revision       = 28 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - configs         = {
                      - params       = {
                          - "server.insecure" = true
                        }
                      - repositories = {
                          - kub1k = {
                              - name     = "(sensitive value)"
                              - password = "(sensitive value)"
                              - type     = "(sensitive value)"
                              - url      = "(sensitive value)"
                              - username = "(sensitive value)"
                            }
                        }
                      - secret       = {
                          - argocdServerAdminPassword = "(sensitive value)"
                        }
                    }
                  - controller      = {
                      - metrics = {
                          - enabled        = true
                          - serviceMonitor = {
                              - enabled = true
                            }
                        }
                    }
                  - dex             = {
                      - enabled = false
                    }
                  - global          = {
                      - domain = "(sensitive value)"
                    }
                  - notifications   = {
                      - enabled = false
                    }
                  - redis           = {
                      - enabled = true
                      - metrics = {
                          - enabled = false
                        }
                    }
                  - redis-ha        = {
                      - enabled = false
                    }
                  - redisSecretInit = {
                      - enabled = true
                    }
                  - repoServer      = {
                      - metrics  = {
                          - enabled        = true
                          - serviceMonitor = {
                              - enabled = true
                            }
                        }
                      - replicas = 1
                    }
                  - server          = {
                      - certificate = {
                          - enabled = true
                          - issuer  = {
                              - group = "cert-manager.io"
                              - kind  = "ClusterIssuer"
                              - name  = "letsencrypt-prod"
                            }
                        }
                      - ingress     = {
                          - enabled          = true
                          - ingressClassName = "haproxy"
                          - tls              = true
                        }
                      - metrics     = {
                          - enabled        = true
                          - serviceMonitor = {
                              - enabled = true
                            }
                        }
                      - replicas    = 1
                    }
                }
            ) -> (known after apply)
          ~ version        = "9.0.5" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      + take_ownership             = false
      + upgrade_install            = false
        # (28 unchanged attributes hidden)
    }

  # module.provision_apps[0].helm_release.argocd_app_of_apps will be updated in-place
  ~ resource "helm_release" "argocd_app_of_apps" {
      ~ id                         = "argocd-app-of-apps" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "2.1.0" -> (known after apply)
          ~ chart          = "argocd-app-of-apps" -> (known after apply)
          ~ first_deployed = 1748547039 -> (known after apply)
          ~ last_deployed  = 1751089029 -> (known after apply)
          ~ name           = "argocd-app-of-apps" -> (known after apply)
          ~ namespace      = "argocd" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 3 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - environment             = "(sensitive value)"
                  - externalDomain          = "(sensitive value)"
                  - internalDomain          = "(sensitive value)"
                  - k8sClusterDNS           = "(sensitive value)"
                  - k8sEndpoint             = "(sensitive value)"
                  - l2AnnouncementInterface = "(sensitive value)"
                  - lbIpPool                = "(sensitive value)"
                }
            ) -> (known after apply)
          ~ version        = "2.1.0" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd-app-of-apps"
      + take_ownership             = false
      + upgrade_install            = false
        # (26 unchanged attributes hidden)
    }

  # module.provision_apps[0].helm_release.calico will be updated in-place
  ~ resource "helm_release" "calico" {
      ~ id                         = "tigera-operator" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v3.31.0" -> (known after apply)
          ~ chart          = "tigera-operator" -> (known after apply)
          ~ first_deployed = 1748546096 -> (known after apply)
          ~ last_deployed  = 1761358439 -> (known after apply)
          ~ name           = "tigera-operator" -> (known after apply)
          ~ namespace      = "tigera-operator" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 12 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - defaultFelixConfiguration = {
                      - enabled                  = true
                      - prometheusMetricsEnabled = true
                    }
                  - installation              = {
                      - calicoNetwork    = {
                          - bgp            = "Disabled"
                          - ipPools        = [
                              - {
                                  - blockSize     = 24
                                  - cidr          = "172.27.0.0/21"
                                  - encapsulation = "VXLANCrossSubnet"
                                  - natOutgoing   = "Enabled"
                                  - nodeSelector  = "all()"
                                },
                            ]
                          - linuxDataplane = "BPF"
                        }
                      - registry         = "quay.io"
                      - typhaMetricsPort = 9093
                    }
                  - kubernetesServiceEndpoint = {
                      - host = "10.0.0.241"
                      - port = "6443"
                    }
                }
            ) -> (known after apply)
          ~ version        = "v3.31.0" -> (known after apply)
        } -> (known after apply)
        name                       = "tigera-operator"
      + take_ownership             = false
      + upgrade_install            = false
        # (27 unchanged attributes hidden)
    }

  # module.provision_apps[0].helm_release.coredns will be updated in-place
  ~ resource "helm_release" "coredns" {
      ~ id                         = "kube-coredns" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.13.1" -> (known after apply)
          ~ chart          = "coredns" -> (known after apply)
          ~ first_deployed = 1750693994 -> (known after apply)
          ~ last_deployed  = 1760793321 -> (known after apply)
          ~ name           = "kube-coredns" -> (known after apply)
          ~ namespace      = "kube-system" -> (known after apply)
          ~ notes          = <<-EOT
                CoreDNS is now running in the cluster as a cluster-service.
                
                It can be tested with the following:
                
                1. Launch a Pod with DNS tools:
                
                kubectl run -it --rm --restart=Never --image=infoblox/dnstools:latest dnstools
                
                2. Query the DNS server:
                
                / # host kubernetes
            EOT -> (known after apply)
          ~ revision       = 7 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - deployment          = {
                      - enabled = true
                    }
                  - k8sAppLabelOverride = "kube-dns"
                  - podDisruptionBudget = {
                      - minAvailable = 1
                    }
                  - prometheus          = {
                      - monitor = {
                          - enabled = true
                        }
                      - service = {
                          - annotations = {
                              - "prometheus.io/port"   = "9153"
                              - "prometheus.io/scrape" = "true"
                            }
                          - enabled     = true
                        }
                    }
                  - replicaCount        = 3
                  - service             = {
                      - clusterIP = "(sensitive value)"
                    }
                }
            ) -> (known after apply)
          ~ version        = "1.45.0" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-coredns"
      + take_ownership             = false
      + upgrade_install            = false
        # (28 unchanged attributes hidden)
    }

  # module.provision_apps[0].helm_release.crds will be updated in-place
  ~ resource "helm_release" "crds" {
      ~ id                         = "crds" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "1.0.0" -> (known after apply)
          ~ chart          = "crds" -> (known after apply)
          ~ first_deployed = 1748546091 -> (known after apply)
          ~ last_deployed  = 1750693588 -> (known after apply)
          ~ name           = "crds" -> (known after apply)
          ~ namespace      = "default" -> (known after apply)
          ~ notes          = "" -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode({}) -> (known after apply)
          ~ version        = "1.0.0" -> (known after apply)
        } -> (known after apply)
        name                       = "crds"
      + take_ownership             = false
      + upgrade_install            = false
        # (25 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```